---
kind: property
id: P:Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.EndNode
source: html/8650c34e-7842-892f-f31a-449112b6d57d.htm
---
# Autodesk.Revit.DB.Analysis.MEPAnalyticalSegment.EndNode Property

The id of the end analytical node.

## Syntax (C#)
```csharp
public int EndNode { get; }
```